src/storage-features-list.org
#+Title: 存储特性清单

本文基于IO栈从上往下顺序, 介绍SAN存储特性.

* 增值服务 - 数据保护
** 快照
*** 介绍
在不中断正常业务前提下, 生成源卷某一时间点的副本. 一般在秒级时间内可生成.
快照实现分为写时拷贝(COW, Copy On Write)和写时重定(Redirect On Write)向两种.
在HDD介质存储系统中, 随机顺序特性严重影响读写性能, 在顺序读写场景下,写时拷贝
有更好的读性能, 写时重定向有更好的写性能. 在SSD介质存储系统中, 为延长SSD寿命,
一般都有压缩/重删/磨损均衡特性, 底层数据已经打散, 一般采用写时重定向方案.

快照有生成速度快, 占用空间小优点. 其缺点是, 源卷损坏离线后, 快照卷也无法访问.

IBM SVC FlashCopy, Huawei HyperSnap都是采用写时复制技术实现的快照功能.

*** 功能清单
- 创建
- 删除
- 回滚
- 级联
- 快照卷读写

*** 系统影响

*** 用户场景

*** 原理及实现
** 镜像
*** 介绍
** 克隆
** 远程复制
** 双活
** 异构虚拟化
* 主机适配 - Target基本功能
* 主机适配 - 虚拟化应用VAAI
* 主机适配 - Targe
* 性能加速 - 缓存技术
** 总体介绍
** 缓存分区
** 缓存保护
