storage-features-list.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-03 Sun 01:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>存储特性清单</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
    <link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">存储特性清单</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7834876">1. 增值服务 - 数据保护</a>
<ul>
<li><a href="#org2f6ca0f">1.1. 快照</a>
<ul>
<li><a href="#org981579f">1.1.1. 介绍</a></li>
<li><a href="#org04fa7dd">1.1.2. 功能清单</a></li>
<li><a href="#org92bce8b">1.1.3. 系统影响</a></li>
<li><a href="#orge99fd2c">1.1.4. 用户场景</a></li>
<li><a href="#orgc41fd0c">1.1.5. 原理及实现</a></li>
</ul>
</li>
<li><a href="#org860fc0b">1.2. 镜像</a>
<ul>
<li><a href="#org0f7f5d9">1.2.1. 介绍</a></li>
</ul>
</li>
<li><a href="#org21fe72a">1.3. 克隆</a></li>
<li><a href="#orgea47802">1.4. 远程复制</a></li>
<li><a href="#org1dba4d6">1.5. 双活</a></li>
<li><a href="#org5a86fd5">1.6. 异构虚拟化</a></li>
</ul>
</li>
<li><a href="#org144cf87">2. 主机适配 - Target基本功能</a></li>
<li><a href="#orgcbb6f4e">3. 主机适配 - 虚拟化应用VAAI</a></li>
<li><a href="#org43816f3">4. 主机适配 - Targe</a></li>
<li><a href="#orgcde74f5">5. 性能加速 - 缓存技术</a>
<ul>
<li><a href="#org0f8283c">5.1. 总体介绍</a></li>
<li><a href="#orgfea9b7f">5.2. 缓存分区</a></li>
<li><a href="#org50ee248">5.3. 缓存保护</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本文基于IO栈从上往下顺序, 介绍SAN存储特性.
</p>

<div id="outline-container-org7834876" class="outline-2">
<h2 id="org7834876"><span class="section-number-2">1</span> 增值服务 - 数据保护</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2f6ca0f" class="outline-3">
<h3 id="org2f6ca0f"><span class="section-number-3">1.1</span> 快照</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org981579f" class="outline-4">
<h4 id="org981579f"><span class="section-number-4">1.1.1</span> 介绍</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
在不中断正常业务前提下, 生成源卷某一时间点的副本. 一般在秒级时间内可生成.
快照实现分为写时拷贝(COW, Copy On Write)和写时重定(Redirect On Write)向两种.
在HDD介质存储系统中, 随机顺序特性严重影响读写性能, 在顺序读写场景下,写时拷贝有更好的读性能, 写时重定向有更好的写性能. 在SSD介质存储系统中, 为延长SSD寿命,
一般都有压缩/重删/磨损均衡特性, 底层数据已经打散, 一般采用写时重定向方案.
</p>

<p>
快照有生成速度快, 占用空间小优点. 其缺点是, 源卷损坏离线后, 快照卷也无法访问.
</p>

<p>
IBM SVC FlashCopy, Huawei HyperSnap都是采用写时复制技术实现的快照功能.
</p>
</div>
</div>

<div id="outline-container-org04fa7dd" class="outline-4">
<h4 id="org04fa7dd"><span class="section-number-4">1.1.2</span> 功能清单</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>创建</li>
<li>删除</li>
<li>回滚</li>
<li>级联</li>
<li>快照卷读写</li>
</ul>
</div>
</div>

<div id="outline-container-org92bce8b" class="outline-4">
<h4 id="org92bce8b"><span class="section-number-4">1.1.3</span> 系统影响</h4>
</div>

<div id="outline-container-orge99fd2c" class="outline-4">
<h4 id="orge99fd2c"><span class="section-number-4">1.1.4</span> 用户场景</h4>
</div>

<div id="outline-container-orgc41fd0c" class="outline-4">
<h4 id="orgc41fd0c"><span class="section-number-4">1.1.5</span> 原理及实现</h4>
</div>
</div>
<div id="outline-container-org860fc0b" class="outline-3">
<h3 id="org860fc0b"><span class="section-number-3">1.2</span> 镜像</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0f7f5d9" class="outline-4">
<h4 id="org0f7f5d9"><span class="section-number-4">1.2.1</span> 介绍</h4>
</div>
</div>
<div id="outline-container-org21fe72a" class="outline-3">
<h3 id="org21fe72a"><span class="section-number-3">1.3</span> 克隆</h3>
</div>
<div id="outline-container-orgea47802" class="outline-3">
<h3 id="orgea47802"><span class="section-number-3">1.4</span> 远程复制</h3>
</div>
<div id="outline-container-org1dba4d6" class="outline-3">
<h3 id="org1dba4d6"><span class="section-number-3">1.5</span> 双活</h3>
</div>
<div id="outline-container-org5a86fd5" class="outline-3">
<h3 id="org5a86fd5"><span class="section-number-3">1.6</span> 异构虚拟化</h3>
</div>
</div>
<div id="outline-container-org144cf87" class="outline-2">
<h2 id="org144cf87"><span class="section-number-2">2</span> 主机适配 - Target基本功能</h2>
</div>
<div id="outline-container-orgcbb6f4e" class="outline-2">
<h2 id="orgcbb6f4e"><span class="section-number-2">3</span> 主机适配 - 虚拟化应用VAAI</h2>
</div>
<div id="outline-container-org43816f3" class="outline-2">
<h2 id="org43816f3"><span class="section-number-2">4</span> 主机适配 - Targe</h2>
</div>
<div id="outline-container-orgcde74f5" class="outline-2">
<h2 id="orgcde74f5"><span class="section-number-2">5</span> 性能加速 - 缓存技术</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0f8283c" class="outline-3">
<h3 id="org0f8283c"><span class="section-number-3">5.1</span> 总体介绍</h3>
</div>
<div id="outline-container-orgfea9b7f" class="outline-3">
<h3 id="orgfea9b7f"><span class="section-number-3">5.2</span> 缓存分区</h3>
</div>
<div id="outline-container-org50ee248" class="outline-3">
<h3 id="org50ee248"><span class="section-number-3">5.3</span> 缓存保护</h3>
</div>
</div>
</div>
</body>
</html>
